[{"title": "Mega pop star set to headline AFL final", "content": "Pop icon Katy Perry is reportedly in discussions to star in one of Australia’s biggest sporting events. Global pop star Katy Perry looks set to light up one of Australia’s most lavish sporting spectacles, with the beloved singer reportedly in advanced talks with the AFL to headline the code’s Grand Final carnival. The deal, first reported by The Herald Sun, would bring the ‘Teenage Dream’ and ‘Last Friday Night’ singer back to the 100,000 capacity Melbourne Cricket Ground after she performed there for the T...", "ner_results": {"headline": "Mega pop star set to headline AFL final", "vague_reference": "star", "first_named_entity": "Katy Perry", "article_url": "https://www.news.com.au/entertainment/music/pop-star-katy-perry-reportedly-in-discussions-to-start-at-afl-grand-final/news-story/7b584be9bd1d6585dab35e903976a0f1", "image_url": "https://content.api.news/v3/images/bin/6fd4be9ecaec09758443484b7418fe73"}}, {"title": "Huge star surprises Aussie busker mid-song", "content": "A  woman singing a hit song in the streets of Brisbane got the shock of her life when the superstar behind it showed up and joined in. What are the odds of a busker singing a hit song on the street, right as the famous singer behind it casually walks by? That exact situation unfolded in Brisbane on Wednesday when Melbourne-born performer Inoxia began singing US superstar Teddy Swims’ chart-topping track, Lose Control. Before she reached the chorus, Inoxia spotted Swims, 31, approaching her, prompting her to...", "ner_results": {"headline": "Huge star surprises Aussie busker mid-song", "vague_reference": "star", "first_named_entity": "Brisbane", "article_url": "https://www.news.com.au/entertainment/music/teddy-swims-surprises-australian-busker-singing-his-song-in-brisbane/news-story/e6d452a761102a03e57d9dda81a8f5a7", "image_url": "https://content.api.news/v3/images/bin/7d37b823ba8c1808d14bb430ee059e18"}}, {"title": "Hollywood legend touches down in Aus", "content": "A Hollywood legend who starred in one of the best science fiction films of all time is among the star-studded line-up headlining Australia’s biggest pop culture event. Legendary Hollywood actor Robert Patrick is in Sydney to meet fans at Australia’s biggest pop culture convention Supanova, being held at Sydney Olympic Park this weekend. Mr Patrick is well known for his villainous role as the fully autonomous robot T1000 in the action-packed film Terminator 2: Judgement Day, starring alongside Arnold Schwarz...", "ner_results": {"headline": "Hollywood legend touches down in Aus", "vague_reference": "legend", "first_named_entity": "Robert Patrick", "article_url": "https://www.news.com.au/entertainment/terminator-2-star-robert-patrick-buffy-actor-james-marsters-among-headlines-of-sydneys-supanova-pop-culture-event/news-story/b090cf34d6474a0986b0453dc2cb1bab", "image_url": "https://content.api.news/v3/images/bin/ec7931ced5e587d4f2e8e85eff2652f8"}}, {"title": "Radio star exposes brutal dating reality", "content": "From ghosting to a seven-minute voice message, radio personality Bianca Dye reveals the reality of modern dating in her 50s. The world can be split between people who agree or disagree with having pineapple on a pizza, taking a screaming child into a fancy restaurant or shagging on the first date. (Don’t ask for my opinion on any of those as you will judge me.) But the latest debate dividing people: Is it OK or not OK to leave a voice message instead of calling or writing a text?  Now you can ask my opinion...", "ner_results": {"headline": "Radio star exposes brutal dating reality", "vague_reference": "star", "first_named_entity": null, "article_url": "https://www.news.com.au/lifestyle/we-would-never-have-met-bianca-dye-on-ghosting-a-sevenminute-voice-message-and-the-reality-of-dating-in-her-50s/news-story/d44107e9097a4a6f126f9a6b42a239e2", "image_url": "https://content.api.news/v3/images/bin/ed69ea7d094b29b57ac2f3f3327b4148"}}, {"title": "Star’s surprising red carpet footwear", "content": "Brooke Shields absolutely radiated at the Tony Awards in a yellow dress, but it was her equally bright footwear that turned heads. Brooke Shields absolutely radiated at the Tony Awards in New York on Sunday night, local time.  But it wasn’t her sequined bright yellow Monique Lhuillier gown that was the talk of the event. Rather, the actress’ surprising choice of footwear: a practical pair of equally bright yellow Crocs. “I got my Crocs! I couldn’t do this in heels!” the actress told People magazine on the r...", "ner_results": {"headline": "Star’s surprising red carpet footwear", "vague_reference": "star", "first_named_entity": "Brooke Shields", "article_url": "https://www.news.com.au/entertainment/celebrity-style/red-carpet/brooke-shields-reveals-surprising-choice-of-footwear-under-her-designer-gown-at-the-tony-awards/news-story/8de23640624e098e9867f19536d07415", "image_url": "https://content.api.news/v3/images/bin/cdef18fac3f833fd041fb283ba74ac65"}}, {"title": "‘Little b*****s’: TV host’s wild spray at Aussies", "content": "The Project host Kate Langbroek has left fellow panellists stunned after mocking people who “lined up like little b*****s” during the pandemic. The Project host Kate Langbroek has mocked people who “lined up like little b*****s” to get the Covid jab. The comedian and broadcaster made the comments on Tuesday night’s panel during a discussion about tennis star Novak Djokovic, who was in the headlines again this week after accusing the Wimbledon crowd of “disrespect” for booing him during his straight sets vic...", "ner_results": {"headline": "‘Little b*****s’: TV host’s wild spray at Aussies", "vague_reference": "host", "first_named_entity": "Kate Langbroek", "article_url": "https://www.news.com.au/entertainment/tv/current-affairs/the-project-host-kate-langbroek-mocks-people-who-lined-up-like-little-bs-to-get-covid-jab/news-story/f464f735cdaf6ecf5bc2525473bcd8e6", "image_url": "https://content.api.news/v3/images/bin/d74c7ef612fb0f585395dcfb627c413f"}}, {"title": "Well-known comedian to replace Sheargold", "content": "One of Australia’s most popular stand-up comedians has been tapped to replace Marty Sheargold on radio, after the star abruptly quit. Triple M has announced who will host its new breakfast show in Melbourne, after Marty Sheargold’s shock decision to quit. Comedian Wil Anderson, former AFL star Dale ‘Daisy’ Thomas and Triple M veteran Rosie Walton will co-host the program from Monday July 15. The trio are only a temporary show though. They’ll host the breakfast program through till the end of the AFL season,...", "ner_results": {"headline": "Well-known comedian to replace Sheargold", "vague_reference": "comedian", "first_named_entity": "Dale ‘Daisy’ Thomas", "article_url": "https://www.news.com.au/entertainment/tv/radio/wellknown-comedian-to-replace-marty-sheargold-on-triple-m/news-story/385782168f03914911d3cdc2fe5dc740", "image_url": "https://content.api.news/v3/images/bin/677f51e6e302cb68ae0f82b8614b2950"}}, {"title": "Aussie TV star reveals huge news", "content": "One of the stars of an iconic Australian TV show has shared big news with fans online, as hundreds race to share their thoughts. One of Australia’s best-known TV stars has made a big announcement with his wife, revealing the pair are expecting their first child.  Bondi Rescue lifeguard Trent ‘Maxi’ Maxwell shared a series of photos to Instagram, with he and his hairstylist wife Tahlia embracing on the beach as she showed off her growing bump.  The photos were captioned: “Baby Maxwell coming soon.” Fans deli...", "ner_results": {"headline": "Aussie TV star reveals huge news", "vague_reference": "star", "first_named_entity": null, "article_url": "https://www.news.com.au/entertainment/celebrity-life/bondi-rescue-star-trent-maxwell-reveals-big-news-with-wife-tahlia/news-story/f742c2249d19f51d66f81491e26414ce", "image_url": "https://content.api.news/v3/images/bin/198442da0cc2a9e2f4ab54af20b5d757"}}, {"title": "Rock legend reveals truth about arrest", "content": "Legendary rocker Melissa Etheridge talks to news.com.au about personal tragedy, her ambitious new project and her own brush with the law. Rock legend Melissa Etheridge’s latest project was born from a family tragedy: The loss of her 21-year-old son Beckett in 2020 due to causes related to opioid addiction. The new two-part documentary series I’m Not Broken sees Etheridge speak in detail about the circumstances leading to her son’s death. But the doco, now streaming on Paramount+, also takes a wider focus so...", "ner_results": {"headline": "Rock legend reveals truth about arrest", "vague_reference": "legend", "first_named_entity": "Melissa Etheridge", "article_url": "https://www.news.com.au/entertainment/tv/streaming/melissa-etheridge-on-personal-tragedy-that-informed-new-prison-doco-im-not-broken/news-story/2427d37a436d19a129999c127f74a369", "image_url": "https://content.api.news/v3/images/bin/0a7171d8c86fbce462fc4bd4433a7f70"}}, {"title": "‘Awful’ thing Kidman made co-star do on set", "content": "Nicole Kidman’s co-star Joey King spoke about the “awful” routine the Aussie actress made her do on the set of their new Netflix movie. Nicole Kidman likes to feel and share the burn. During an appearance on The Tonight Show with Jimmy Fallon on Monday, Kidman’s A Family Affair co-star Joey King spoke about what she had learned from working with the Academy Award-winning actress on the Netflix film, which also stars Hollywood heart-throb Zac Efron. “They’re both like so hot,” she told Fallon of the actors, ...", "ner_results": {"headline": "‘Awful’ thing Kidman made co-star do on set", "vague_reference": "star", "first_named_entity": "Nicole Kidman’s", "article_url": "https://www.news.com.au/entertainment/movies/new-movies/joey-king-describes-costar-nicole-kidmans-rigorous-butt-workouts-as-epic-and-awful/news-story/4634cce381fe7dffea638765a475480e", "image_url": "https://content.api.news/v3/images/bin/3e90f03fb544102baa0358204fe64e36"}}, {"title": "Channing Tatum dishes on co-star Scarlett", "content": "Channing Tatum has lifted the lid on working with Scarlett Johansson – including his on set habit that left her “agitated”. Channing Tatum, by his own admission, isn’t the easiest person to work with in Hollywood. The actor, who stars in the sharp new comedy-drama Fly Me To The Moon, couldn’t help but “constantly mess” with his co-star, Scarlett Johansson, during filming. Given that their on-screen characters – NASA Apollo 11 launch director Cole Davis and marketing maven Kelly Jones, who’s enlisted to “sel...", "ner_results": {"headline": "Channing Tatum dishes on co-star Scarlett", "vague_reference": "star", "first_named_entity": "Cole Davis", "article_url": "https://www.news.com.au/entertainment/movies/new-movies/channing-tatums-confession-about-fly-me-to-the-moon-costar-scarlett-johansson-annoy-her/news-story/8a94f8891fc81004fe2febc232d9129d", "image_url": "https://content.api.news/v3/images/bin/cc33c7ab27de78e4c13988eeb88b19fb"}}, {"title": "Rapper leaks Kanye West’s texts", "content": "Rapper Kanye West has apparently revealed a major career update in leaked texts sent to a fellow rapper. Kanye West appears to be calling it quits on his music career. News of the US rapper’s retirement plans were revealed in an alleged text message exchange with rapper Rich The Kid, who uploaded a screenshot to his Instagram Story of messages purportedly sent by ‘Ye’ – the name West has been known by legally since 2021. In the texts, West appeared to say he was stepping away from the industry because he wa...", "ner_results": {"headline": "Rapper leaks Kanye West’s texts", "vague_reference": "rapper", "first_named_entity": "Rich The Kid", "article_url": "https://www.news.com.au/entertainment/music/kanye-west-supposedly-reveals-hes-retiring-from-music-in-leaked-texts-to-rapper/news-story/5a8d9636ee63a58c38a56c385e81f61f", "image_url": "https://content.api.news/v3/images/bin/991ab2daa43e373ef38bdb0530069d19"}}, {"title": "Shock Young Gold Logie nominee named", "content": "Can Sonia Kruger take home back-to-back Gold Logies? She has some tough competition after a beloved newcomer is nominated in this year’s coveted category. The nominations are officially in for the 2024 Logies.  The 64th TV Week Logie Awards is set to take place at The Star in Sydney on Sunday, August 18 with Australia’s biggest stars vying for the coveted 23 awards in their respective categories.  The full list of nominees were announced on Sunday afternoon at a media call at a private residence in Sydney’s...", "ner_results": {"headline": "Shock Young Gold Logie nominee named", "vague_reference": "nominee", "first_named_entity": "Sonia Kruger", "article_url": "https://www.news.com.au/entertainment/awards/logies/all-the-nominations-for-the-2024-logie-awards/news-story/84ef69bd5b4ab13ac12d8b61a44e0c7e", "image_url": "https://content.api.news/v3/images/bin/a1f3873eaa38cba65d41499e87b1605c"}}, {"title": "Inside pop star’s surprising career switch", "content": "He went from rubbing shoulders with Hollywood A-listers before making a shock change in an aim for gold. Five years ago, Cody Simpson bet it all. He was on top of the entertainment world, from his humble beginnings as a YouTuber which launched a lucrative career as one of Australia’s most recognised singer-songwriters, working and performing with the likes of Miley Cyrus, Justin Bieber and Flo Rida. The stage spotlight was swapped out for Olympic glory in the swimming pool in 2020. It left fans spinning – w...", "ner_results": {"headline": "Inside pop star’s surprising career switch", "vague_reference": "star", "first_named_entity": "Cody Simpson", "article_url": "https://www.news.com.au/entertainment/music/left-nothing-to-the-unknown-how-pop-star-cody-simpson-shot-to-fame-in-the-fast-lane-before-making-a-huge-switch/news-story/66db52aa135c88714faed24ac044508b", "image_url": "https://content.api.news/v3/images/bin/7f2c99a3300164ffa17c813d4c66d0b6"}}, {"title": "‘Shocked’: Star, 28, seen with singer, 24", "content": "A famous and single actor has been seen getting dinner with an upcoming singer who just dropped her new album. A-list actor Paul Mescal and singer Gracie Abrams have been spotted dining together in London. Mescal, 28, who is still dining out on the success of the limited series Normal People and will star in the highly anticipated Gladiator sequel, has been seen having a cozy dinner with Taylor Swift’s former opening act, Abrams. Abrams, 24, has just released her sophomore album, The Secret of Us, which fea...", "ner_results": {"headline": "‘Shocked’: Star, 28, seen with singer, 24", "vague_reference": "star", "first_named_entity": "Paul Mescal", "article_url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-photos/single-alister-actor-seen-hanging-with-a-popular-singer/news-story/ebd490cebc3d47cb95c9fc294bf5c120", "image_url": "https://content.api.news/v3/images/bin/37f438bf3f3d7f5fd4a54347088c858a"}}, {"title": "Aussie radio legend dies age 72", "content": "Tributes are flowing for an Australian radio legend following news of his death at age 72. Legendary Australian radio presenter and voice talent Ron E Sparks has died aged 72. In a touching post his former WSFM colleagues Brendan “Jonesey” Jones and Amanda Keller revealed Mr Sparks’ passing on their official Instagram page. “We are devastated to announce the heartbreaking news of the passing of former WSFM announcer Ron E Sparks. Vale,” they wrote. Mr Sparks began his radio career on Sydney’s 2SM in the 197...", "ner_results": {"headline": "Aussie radio legend dies age 72", "vague_reference": "legend", "first_named_entity": "Legendary Australian", "article_url": "https://www.news.com.au/entertainment/tv/radio/australian-radio-voiceover-legend-ron-e-sparks-dies-aged-72/news-story/7b667bb632b5627d7d9f7054391f3a11", "image_url": "https://content.api.news/v3/images/bin/28f577e0568477fe4b8f8c676256c26e"}}, {"title": "Sinister plan to rape and murder TV star", "content": "A security guard has been sentenced over a plot to kidnap, rape and murder British television star Holly Willoughby. A security guard has been jailed for life over a plot to kidnap, rape and murder British television presenter Holly Willoughby after growing obsessed with the star. Gavin Plumb, 37, hatched the sinister plan to ambush his so-called “fantasy” Holly at her home and “stupefy” her using chloroform, The Sun reports. The 35st security guard then wanted to tie the star up and take her to a “dungeon”...", "ner_results": {"headline": "Sinister plan to rape and murder TV star", "vague_reference": "star", "first_named_entity": "Holly Willoughby", "article_url": "https://www.news.com.au/entertainment/tv/security-guard-jailed-for-life-over-plot-to-rape-and-murder-tv-star-holly-willoughby/news-story/2900e3fc2117efff0b42d676bd6a9a88", "image_url": "https://content.api.news/v3/images/bin/87d23a535caffd8cafc18fc26daf6b6d"}}, {"title": "Sam Neill reunites with co-star after 13 years", "content": "Golden Globe-nominated actress Frances O’Connor has returned home to star in the highly anticipated new season of an award-winning Aussie drama. Frances O’Connor has returned home from the UK to star in the highly anticipated new season of The Twelve. The British-born Australian actress joins Sam Neill for Season 2 of the award-winning crime drama, which premiered this week on BINGE, with new episodes dropping weekly.  Given the new season was filmed in her home town of Perth and its rural surrounds, the Go...", "ner_results": {"headline": "Sam Neill reunites with co-star after 13 years", "vague_reference": "star", "first_named_entity": "Golden Globe-nominated", "article_url": "https://www.news.com.au/entertainment/tv/streaming/frances-oconnor-returns-home-to-star-in-awardwinning-aussie-series-the-twelve/news-story/6966366f669ded7e9498ab83ea3d6da4", "image_url": "https://content.api.news/v3/images/bin/36976765904b95b56ca0552fd481e52a"}}, {"title": "Noughties star strips off for emotional post", "content": "The noughties pop star had “super personal” news to share today, in a musical career that’s had its fair share of ups and downs. Noughties pop star Nelly Furtado has shared some emotional news with fans, announcing the upcoming release of her first studio album in more than seven years. And judging by her new single Corazón, released today, it’ll be a return to the dance floor sounds of her biggest album, 2006’s Loose. Furtado, 45, has released six albums, beginning with 2000s Whoa, Nelly! Her career had it...", "ner_results": {"headline": "Noughties star strips off for emotional post", "vague_reference": "star", "first_named_entity": "Nelly Furtado", "article_url": "https://www.news.com.au/entertainment/music/nelly-furtado-strips-off-for-emotional-announcement/news-story/4e9b4bf835e46172a2c1c006290886a7", "image_url": "https://content.api.news/v3/images/bin/f6cc068fffdfd970330eee8c8934cbf4"}}]