[{"title": "Pop singer stuns and goes full Baywatch", "content": "A famous pop singer has taken a holiday just before her album drops - and she’s had her very own Baywatch moment. Pop singer Sabrina Carpenter has had her very own Pamela Anderson Baywatch moment. The 25-year-old singer, who is enjoying massive success with her two singles Espresso and Please Please Please, posted a photo dump on Instagram of her enjoying some vacation time. The pint-sized singer, who is just under five feet tall, looked gorgeous on the beach in a one-piece red swimsuit that looked fresh fr...", "ner_results": {"headline": "Pop singer stuns and goes full Baywatch", "vague_reference": "singer", "first_named_entity": "Sabrina Carpenter", "article_url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-photos/pop-singer-has-her-very-own-baywatch-moment/news-story/661fa1b4ecb9ad49a012c40316fb0f21", "image_url": "https://content.api.news/v3/images/bin/e08ec7693845c0361fb660581fde29a1"}}, {"title": "Star’s ‘mean’ Aussie interview resurfaces", "content": "Katy Perry’s own words are coming back to haunt her, with a notorious 2014 moment on Seven’s Sunrise resurfacing on social media. Pop star Katy Perry’s own words are coming back to bite, as an infamous snippet from a 10-year-old Australian interview resurfaces on social media this week. The moment took place during Perry’s extended in-studio appearance on Seven’s breakfast show Sunrise back in 2014, while she was promoting her next Australian tour.  During the interview, then-co-host Samantha Armytage descr...", "ner_results": {"headline": "Star’s ‘mean’ Aussie interview resurfaces", "vague_reference": "star", "first_named_entity": "Katy Perry’s", "article_url": "https://www.news.com.au/entertainment/tv/flashback/katy-perrys-mean-aussie-interview-resurfaces/news-story/8354e20046d1b7c72c4bcd0c8092ff11", "image_url": "https://content.api.news/v3/images/bin/ef6862dc0134cff1a5e86d8d51862f95"}}, {"title": "Star recreates infamous movie nude scene", "content": "Sharon Stone has recreated one of the most infamous nude scenes in cinema history, some 32 years after she bared all on screen. Sharon Stone is channeling her inner Basic Instinct character, Catherine Tramell.  This week, the famed actress — who rose to fame in the 1990s with breakthrough roles in Basic Instinct and Casino — posted a photo of herself recreating an iconic scene from the Paul Verhoeven-directed hit film. In the photo posted to Instagram, 66-year-old Stone wore a red, laced lingerie ensemble a...", "ner_results": {"headline": "Star recreates infamous movie nude scene", "vague_reference": "star", "first_named_entity": "Sharon Stone", "article_url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-photos/sharon-stone-recreates-infamous-basic-instinct-nude-scene/news-story/e4b3c7b0343494d1972c1475a7ac7e68", "image_url": "https://content.api.news/v3/images/bin/a276678b5cf767977e751e3265a42982"}}, {"title": "TV personality Richard Simmons dead at 76", "content": "Legendary TV and fitness personality Richard Simmons has been found dead at home, TMZ is reporting. Legendary fitness guru and TV personality Richard Simmons has died at the age of 76. According to TMZ, emergency workers were called to his home by his housekeeper on Saturday morning. Simmons, who rose to fame in the 1970s and ‘80s after opening a series of gyms and then releasing dozens of fitness tapes and DVDs, was reportedly pronounced dead at the scene. TMZ added that no foul play is suspected. His deat...", "ner_results": {"headline": "TV personality Richard Simmons dead at 76", "vague_reference": "personality", "first_named_entity": null, "article_url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-deaths/richard-simmons-dead-at-76-legendary-tv-and-fitness-personality-passes-away/news-story/eb4b8173fbaa24b6e2dc735e67a239d5", "image_url": "https://content.api.news/v3/images/bin/cd4a85e1f0f0ece2bd2bed13f240b7ac"}}, {"title": "Hollywood legend touches down in Aus", "content": "A Hollywood legend who starred in one of the best science fiction films of all time is among the star-studded line-up headlining Australia’s biggest pop culture event. Legendary Hollywood actor Robert Patrick is in Sydney to meet fans at Australia’s biggest pop culture convention Supanova, being held at Sydney Olympic Park this weekend. Mr Patrick is well known for his villainous role as the fully autonomous robot T1000 in the action-packed film Terminator 2: Judgement Day, starring alongside Arnold Schwarz...", "ner_results": {"headline": "Hollywood legend touches down in Aus", "vague_reference": "legend", "first_named_entity": "Robert Patrick", "article_url": "https://www.news.com.au/entertainment/terminator-2-star-robert-patrick-buffy-actor-james-marsters-among-headlines-of-sydneys-supanova-pop-culture-event/news-story/b090cf34d6474a0986b0453dc2cb1bab", "image_url": "https://content.api.news/v3/images/bin/ec7931ced5e587d4f2e8e85eff2652f8"}}, {"title": "Radio star exposes brutal dating reality", "content": "From ghosting to a seven-minute voice message, radio personality Bianca Dye reveals the reality of modern dating in her 50s. The world can be split between people who agree or disagree with having pineapple on a pizza, taking a screaming child into a fancy restaurant or shagging on the first date. (Don’t ask for my opinion on any of those as you will judge me.) But the latest debate dividing people: Is it OK or not OK to leave a voice message instead of calling or writing a text?  Now you can ask my opinion...", "ner_results": {"headline": "Radio star exposes brutal dating reality", "vague_reference": "star", "first_named_entity": null, "article_url": "https://www.news.com.au/lifestyle/we-would-never-have-met-bianca-dye-on-ghosting-a-sevenminute-voice-message-and-the-reality-of-dating-in-her-50s/news-story/d44107e9097a4a6f126f9a6b42a239e2", "image_url": "https://content.api.news/v3/images/bin/ed69ea7d094b29b57ac2f3f3327b4148"}}, {"title": "Star’s surprising red carpet footwear", "content": "Brooke Shields absolutely radiated at the Tony Awards in a yellow dress, but it was her equally bright footwear that turned heads. Brooke Shields absolutely radiated at the Tony Awards in New York on Sunday night, local time.  But it wasn’t her sequined bright yellow Monique Lhuillier gown that was the talk of the event. Rather, the actress’ surprising choice of footwear: a practical pair of equally bright yellow Crocs. “I got my Crocs! I couldn’t do this in heels!” the actress told People magazine on the r...", "ner_results": {"headline": "Star’s surprising red carpet footwear", "vague_reference": "star", "first_named_entity": "Brooke Shields", "article_url": "https://www.news.com.au/entertainment/celebrity-style/red-carpet/brooke-shields-reveals-surprising-choice-of-footwear-under-her-designer-gown-at-the-tony-awards/news-story/8de23640624e098e9867f19536d07415", "image_url": "https://content.api.news/v3/images/bin/cdef18fac3f833fd041fb283ba74ac65"}}, {"title": "Star finally reveals truth behind SNL exit", "content": "Fan favourite Andy Samberg has lifted the lid on his shock departure from the show, admitting it took a “heavy toll” on him. Andy Samberg has revealed the real reason why he left Saturday Night Live.  “It was a big choice. For me, it was like, I can’t actually endure it anymore. But I didn’t want to leave,” Samberg, 45, said on the latest episode of Kevin Hart’s interview series Hart to Heart. “Physically and emotionally, like I was falling apart in my life,” Samberg said, reports the New York Post. Samberg...", "ner_results": {"headline": "Star finally reveals truth behind SNL exit", "vague_reference": "star", "first_named_entity": "Andy Samberg", "article_url": "https://www.news.com.au/entertainment/tv/flashback/andy-samberg-reveals-truth-about-shock-snl-exit-falling-apart/news-story/50710e7e65ff00c543b4ff670aa5a1ed", "image_url": "https://content.api.news/v3/images/bin/4838f0568deca56ce7f80b01695b589a"}}, {"title": "Radio legend’s astonishing rebuke of Kyle", "content": "As tributes flow for an Australian radio legend following his death, the moment he snapped at Kyle and Jackie O over their smoking habit has been recalled. The astonishing moment Ron E Sparks lost it at Kyle and Jackie O, scrawling “don’t f***ing smoke” over the walls and dumping used cigarette butts all over the station, has been recalled as tributes flow for the radio legend, who has died aged 72. In a touching post his former WSFM colleagues Brendan “Jonesey” Jones and Amanda Keller revealed Mr Sparks’ d...", "ner_results": {"headline": "Radio legend’s astonishing rebuke of Kyle", "vague_reference": "legend", "first_named_entity": "Jackie O", "article_url": "https://www.news.com.au/entertainment/tv/radio/australian-radio-voiceover-legend-ron-e-sparks-dies-aged-72/news-story/7b667bb632b5627d7d9f7054391f3a11", "image_url": "https://content.api.news/v3/images/bin/28f577e0568477fe4b8f8c676256c26e"}}, {"title": "Sinister plan to rape and murder TV star", "content": "A security guard has been sentenced over a plot to kidnap, rape and murder British television star Holly Willoughby. A security guard has been jailed for life over a plot to kidnap, rape and murder British television presenter Holly Willoughby after growing obsessed with the star. Gavin Plumb, 37, hatched the sinister plan to ambush his so-called “fantasy” Holly at her home and “stupefy” her using chloroform, The Sun reports. The 35st security guard then wanted to tie the star up and take her to a “dungeon”...", "ner_results": {"headline": "Sinister plan to rape and murder TV star", "vague_reference": "star", "first_named_entity": "Holly Willoughby", "article_url": "https://www.news.com.au/entertainment/tv/security-guard-jailed-for-life-over-plot-to-rape-and-murder-tv-star-holly-willoughby/news-story/2900e3fc2117efff0b42d676bd6a9a88", "image_url": "https://content.api.news/v3/images/bin/87d23a535caffd8cafc18fc26daf6b6d"}}, {"title": "Noughties star strips off for emotional post", "content": "The noughties pop star had “super personal” news to share today, in a musical career that’s had its fair share of ups and downs. Noughties pop star Nelly Furtado has shared some emotional news with fans, announcing the upcoming release of her first studio album in more than seven years. And judging by her new single Corazón, released today, it’ll be a return to the dance floor sounds of her biggest album, 2006’s Loose. Furtado, 45, has released six albums, beginning with 2000s Whoa, Nelly! Her career had it...", "ner_results": {"headline": "Noughties star strips off for emotional post", "vague_reference": "star", "first_named_entity": "Nelly Furtado", "article_url": "https://www.news.com.au/entertainment/music/nelly-furtado-strips-off-for-emotional-announcement/news-story/4e9b4bf835e46172a2c1c006290886a7", "image_url": "https://content.api.news/v3/images/bin/f6cc068fffdfd970330eee8c8934cbf4"}}, {"title": "Mega pop star set to headline AFL final", "content": "Pop icon Katy Perry is reportedly in discussions to star in one of Australia’s biggest sporting events. Global pop star Katy Perry looks set to light up one of Australia’s most lavish sporting spectacles, with the beloved singer reportedly in advanced talks with the AFL to headline the code’s Grand Final carnival. The deal, first reported by The Herald Sun, would bring the ‘Teenage Dream’ and ‘Last Friday Night’ singer back to the 100,000 capacity Melbourne Cricket Ground after she performed there for the T...", "ner_results": {"headline": "Mega pop star set to headline AFL final", "vague_reference": "star", "first_named_entity": "Katy Perry", "article_url": "https://www.news.com.au/entertainment/music/pop-star-katy-perry-reportedly-in-discussions-to-start-at-afl-grand-final/news-story/7b584be9bd1d6585dab35e903976a0f1", "image_url": "https://content.api.news/v3/images/bin/6fd4be9ecaec09758443484b7418fe73"}}, {"title": "Shock Young Gold Logie nominee named", "content": "Can Sonia Kruger take home back-to-back Gold Logies? She has some tough competition after a beloved newcomer is nominated in this year’s coveted category. The nominations are officially in for the 2024 Logies.  The 64th TV Week Logie Awards is set to take place at The Star in Sydney on Sunday, August 18 with Australia’s biggest stars vying for the coveted 23 awards in their respective categories.  The full list of nominees were announced on Sunday afternoon at a media call at a private residence in Sydney’s...", "ner_results": {"headline": "Shock Young Gold Logie nominee named", "vague_reference": "nominee", "first_named_entity": "Sonia Kruger", "article_url": "https://www.news.com.au/entertainment/awards/logies/all-the-nominations-for-the-2024-logie-awards/news-story/84ef69bd5b4ab13ac12d8b61a44e0c7e", "image_url": "https://content.api.news/v3/images/bin/a1f3873eaa38cba65d41499e87b1605c"}}, {"title": "Inside pop star’s surprising career switch", "content": "He went from rubbing shoulders with Hollywood A-listers before making a shock change in an aim for gold. Five years ago, Cody Simpson bet it all. He was on top of the entertainment world, from his humble beginnings as a YouTuber which launched a lucrative career as one of Australia’s most recognised singer-songwriters, working and performing with the likes of Miley Cyrus, Justin Bieber and Flo Rida. The stage spotlight was swapped out for Olympic glory in the swimming pool in 2020. It left fans spinning – w...", "ner_results": {"headline": "Inside pop star’s surprising career switch", "vague_reference": "star", "first_named_entity": "Cody Simpson", "article_url": "https://www.news.com.au/entertainment/music/left-nothing-to-the-unknown-how-pop-star-cody-simpson-shot-to-fame-in-the-fast-lane-before-making-a-huge-switch/news-story/66db52aa135c88714faed24ac044508b", "image_url": "https://content.api.news/v3/images/bin/7f2c99a3300164ffa17c813d4c66d0b6"}}]